In [3]:
# import libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [55]:
# load the datasets
titanic=sns.load_dataset('titanic')
ts1=titanic
ts2=titanic
ts=sns.load_dataset('titanic')

In [5]:
# Checking the shape of data sets
titanic.shape

(891, 15)

### Data Wrangling and Cleaning Process

In [6]:
# find out missing values in the data
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
# using dropna method to drop missing values
titanic.dropna(subset=['deck'],axis=0,inplace=True)    # Inplace =True means the change will take place in the original datasets
titanic.shape

(203, 15)

In [8]:
# again checking the missing values of dataset
titanic.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [9]:
# again checking the shape of data
titanic.shape

(203, 15)

In [10]:
#checking the missing values again
titanic.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [11]:
# to drop na
titanic.dropna()
# to update into dataframe
titanic=titanic.dropna().isnull().sum()
titanic

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [12]:
ts1.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

# Replace missing values with the average of that coloum

In [13]:
#finding average of age
mean=ts1['age'].mean()
mean

35.77945652173913

In [14]:
# replace the nan values by mean 
ts1['age']=ts1['age'].replace(np.nan,mean)

In [15]:
# checking the missing values once again
ts1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [16]:
# know the data type and convert into known types
titanic.dtypes

dtype('int64')

In [21]:
# if to convert one data type into another

titanic['survived']=titanic['survived'].astype('int64')
titanic.dtypes

dtype('int64')

In [22]:
titanic.dtypes

dtype('int64')

In [25]:
ts1.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [36]:
ts2['age']=ts2['age']*365
ts2.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,8.985470e+16,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,8.276091e+16,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,1.276883e+17,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,9.458389e+15,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,1.371466e+17,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
21,1,2,male,8.039631e+16,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,6.620872e+16,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0,1,male,4.492735e+16,3,2,263.0000,S,First,man,True,C,Southampton,no,False
31,1,1,female,8.460401e+16,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,1.158653e+17,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False

In [37]:
# rename the coloums
ts2.rename(columns={'age':'age in days'},inplace=True)

In [38]:
ts2.head(4)

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,8.985470e+16,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,8.276091e+16,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,1.276883e+17,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,9.458389e+15,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False

# Data Normalization
 - Making data uniform
 - Making sure data have same impact
 - Also for computational use

In [40]:
ts1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,8.985470e+16,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,8.276091e+16,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,1.276883e+17,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,9.458389e+15,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,1.371466e+17,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [43]:
ts3=ts1[['age in days','fare']]
ts3.head()

     age in days     fare
1   8.985470e+16  71.2833
3   8.276091e+16  53.1000
6   1.276883e+17  51.8625
10  9.458389e+15  16.7000
11  1.371466e+17  26.5500

# Method of Normalization
 - Simple feature scaling
   X(NEW)=X(OLD)/X(MAX)
 - Min- Max method
 - Z-score method
 - Log transformation

In [44]:
# Simple feature scaling
ts1['fare']=ts1['fare']/ts1['fare'].max()

In [47]:
ts3=ts1[['age in days','fare']]
ts3.head()

     age in days      fare
1   8.985470e+16  0.139136
3   8.276091e+16  0.103644
6   1.276883e+17  0.101229
10  9.458389e+15  0.032596
11  1.371466e+17  0.051822

In [48]:
ts1['age in days']=ts1['age in days']/ts1['age in days'].max()

In [49]:
ts3=ts1[['age in days','fare']]
ts3.head()

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822

In [50]:
# Min- Max Method

ts3['fare']=(ts3['fare']- ts3['fare'].min())/(ts3['fare'].max()-ts3['fare'].min())
ts3.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822

In [52]:
# Z-score Method
ts3['fare']=(ts3['fare']- ts3['fare'].min())/ ts3['fare'].std()

ts3.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

    age in days      fare
1        0.4750  0.956559
3        0.4375  0.712555
6        0.6750  0.695949
10       0.0500  0.224099
11       0.7250  0.356278

In [56]:
# Log Transformation

ts['fare']=np.log(ts['fare'])
ts.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\arraylike.py:364: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,1.981001,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,4.266662,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,2.070022,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,3.972177,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,2.085672,S,Third,man,True,NaN,Southampton,no,True